Revit 2026 API

# PartUtilsGetAssociatedPartMaker(Document, ElementId) Method

---

Gets associated PartMaker for an element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PartMaker GetAssociatedPartMaker(
	Document hostDocument,
	ElementId elementId
)
```
```vb
Public Shared Function GetAssociatedPartMaker (
	hostDocument As Document,
	elementId As ElementId
) As PartMaker
```
```cpp
public:
static PartMaker^ GetAssociatedPartMaker(
	Document^ hostDocument,
	ElementId^ elementId
)
```
```fsharp
static member GetAssociatedPartMaker :
        hostDocument : Document *
        elementId : ElementId -> PartMaker
```

#### Parameters

hostDocument Document
     The document
elementId ElementId
     The id for the element to be checked for associated Parts

#### Return Value

PartMaker The PartMaker element that is making Parts for this element.  if there is no associated PartMaker.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

GetAssociatedPartMaker Overload

Autodesk.Revit.DB Namespace